Revit 2027 API
RebarSpliceRules.MinimumBarLength Property
 Identifies the minimum bar length. The default value is 1 meter if the document units are in Metric System, or 3 feet if the units are in Imperial System.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MinimumBarLength { get; set; }
Public Property MinimumBarLength As Double
	Get
	Set
public:
property double MinimumBarLength {
	double get ();
	void set (double value);
}
member MinimumBarLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The minimum bar length should be less or almost equal to the maximum bar length.
ArgumentOutOfRangeException |  When setting this property: The given value for minimumBarLength must be between 0 and 30000 feet.
See Also
Reference
RebarSpliceRules Class
Autodesk.Revit.DB.Structure Namespace